# PushExportState Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..PushExportState Method
ExporterIFC Class See Also
---
Sets the internal state of the exporter to process the geometry and properties of the input element.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void PushExportState(
	Element Elem,
	GeometryElement GRep
)
```

Visual Basic
---
```text
Public Sub PushExportState ( _
	Elem As Element, _
	GRep As GeometryElement _
)
```

Visual C++
---
```text
public:
void PushExportState(
	Element^ Elem,
	GeometryElement^ GRep
)
```

# ### Parameters
Elem
    Type: Autodesk.Revit.DB..::..Element The element.
GRep
    Type: Autodesk.Revit.DB..::..GeometryElement The geometry of the element. Optional, can be nullNothingnullptra null reference (Nothing in Visual Basic).
# Remarks
The element will be assigned until PopExportState() is called.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace